//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура УстановитьОписаниеГлобальногоПоиска() Экспорт
	
	ОписаниеГлобальногоПоискаМассив = Новый Массив;
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Новый ФорматированнаяСтрока("+", Новый Шрифт(,,Истина)));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = ' для быстрого создания документов'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите номер документа для быстрого поиска по номеру'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Новый ФорматированнаяСтрока("долги", Новый Шрифт(,,Истина)));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = ' для просмотра пяти самых крупных должников'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Новый ФорматированнаяСтрока("долг", Новый Шрифт(,,Истина)));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = ' и часть названия контрагента для просмотра его долга'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите название контрагента для быстрого поиска и создания нового заказа'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите строку для поиска, ссылку для перехода или поиска, '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'арифметическое выражение для вычисления'"));
	
	ГлобальныйПоиск.УстановитьОписание(Новый ФорматированнаяСтрока(ОписаниеГлобальногоПоискаМассив));
	
КонецПроцедуры

Процедура ГлобальныйПоискКомандыСоздать(СтрокаПоиска, РезультатПоиска, ДопПараметры) Экспорт
	
	РезультатПоиска.Добавить("+Заказ", НСтр("ru = 'Заказ'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	РезультатПоиска.Добавить("+Приход", НСтр("ru = 'Приходная накладная'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	РезультатПоиска.Добавить("+Расход", НСтр("ru = 'Расходная накладная'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	РезультатПоиска.Добавить("+Оплата", НСтр("ru = 'Оплата'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	
КонецПроцедуры
