//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

&НаКлиенте
Процедура Ответить(Команда)
	ПараметрыФормы = Новый Структура("ВходящееПисьмо", Объект.Ссылка);
	ОткрытьФорму("Справочник.ИсходящиеПисьма.ФормаОбъекта", ПараметрыФормы);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Отбор = Новый Структура("Письмо", Параметры.Ключ);
		БылоПрочитано = РегистрыСведений.СостояниеВходящихПисем.Получить(Отбор).Прочитано;
		Если Не БылоПрочитано Тогда
			НЗ = РегистрыСведений.СостояниеВходящихПисем.СоздатьНаборЗаписей();
			НЗ.Отбор.Письмо.Установить(Параметры.Ключ);
			Запись = НЗ.Добавить();
			Запись.Письмо = Параметры.Ключ;
			Запись.Прочитано = Истина;
			НЗ.Записать();
		КонецЕсли;
		Если Объект.ВидСодержимого = Перечисления.ВидСодержимогоВходящегоПисьма.Текст Тогда
			Текст = Объект.Текст;
			Элементы.Группа.ТекущаяСтраница = Элементы.ГруппаТекст;
		Иначе
			HTML = Объект.Текст;
			Элементы.Группа.ТекущаяСтраница = Элементы.ГруппаHTML;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не БылоПрочитано Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
		//Оповестить("ОбновитьСписокВходящихПисем");
	КонецЕсли;
КонецПроцедуры
