//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УстановитьВидимостьОбъектовЧерезODataAPI();
КонецПроцедуры

Процедура УстановитьВидимостьОбъектовЧерезODataAPI()
	Массив = Новый Массив();
	
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		Массив.Добавить(Справочник);
	КонецЦикла;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
			Массив.Добавить(Документ);
	КонецЦикла;
	
	Для Каждого Перечисление Из Метаданные.Перечисления Цикл
		Массив.Добавить(Перечисление);
	КонецЦикла;
	
	Для Каждого РегистрСведений Из Метаданные.РегистрыСведений Цикл
		Массив.Добавить(РегистрСведений);
	КонецЦикла;
	
	Для Каждого РегистрНакопления Из Метаданные.РегистрыНакопления Цикл
		Массив.Добавить(РегистрНакопления);
	КонецЦикла;

	Для Каждого ПланВидовХарактеристик Из Метаданные.ПланыВидовХарактеристик Цикл
		Массив.Добавить(ПланВидовХарактеристик);
	КонецЦикла;

	Для Каждого Константа Из Метаданные.Константы Цикл
		Массив.Добавить(Константа);
	КонецЦикла;
	
	Для Каждого Журналы Из Метаданные.ЖурналыДокументов Цикл
		Массив.Добавить(Журналы);
	КонецЦикла;
	
	УстановитьСоставСтандартногоИнтерфейсаOData(Массив);
КонецПроцедуры
