//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// обработка события получения данных выбора
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.СтрокаПоиска = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		//Сфорируем список с предупреждениями
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Склады.Ссылка,
			|	Склады.Наименование,
			|	Склады.НеИспользовать
			|ИЗ
			|	Справочник.Склады КАК Склады";

		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Структура = Новый Структура("Значение",  ВыборкаДетальныеЗаписи.Ссылка);
			
			//Заполним предупреждение
			Если ВыборкаДетальныеЗаписи.НеИспользовать Тогда
				ТекстПредупреждения = НСтр("ru='Этот склад не должен использоваться!", "ru");
				Структура.Вставить("Предупреждение", ТекстПредупреждения);
			КонецЕсли;
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Структура;
			Элемент.Представление = ВыборкаДетальныеЗаписи.Наименование;
			
		КонецЦикла;
		
	Иначе
		
		//Исключим неиспользуемые из ввода по строке
		Параметры.Отбор.Вставить("НеИспользовать", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры
