//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

#Если МобильныйКлиент Тогда
	МеткиNDEF = СредстваNFC.МеткиNDEF;
	Если МеткиNDEF.ПоддерживаетсяЗаписьНаМетку() Тогда
		ОповещениеОПоявленииМетки = Новый ОписаниеОповещения("ПриПоявленииМеткиЗаписатьСообщениеNDEF", ЭтотОбъект, ПараметрКоманды);
		МеткиNDEF.ВключитьАктивноеСканирование(, ОповещениеОПоявленииМетки);
	Иначе
		сообщить("Нет возможности для записи метки!");
	КонецЕсли;
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриПоявленииМеткиЗаписатьСообщениеNDEF(Метка, ДополнительныеДанные) Экспорт
	
#Если МобильныйКлиент Тогда
	Если Метка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		записи = Новый Массив(1);
		записи[0] = Новый ТекстоваяЗаписьNDEF(Строка(ДополнительныеДанные.УникальныйИдентификатор()));
		фиксированныеЗаписи = Новый ФиксированныйМассив(записи);
		сообщение = Новый СообщениеNDEF(фиксированныеЗаписи);
		
		ждать Метка.ЗаписатьСообщениеАсинх(сообщение);
	Исключение
		сообщить("Произошла ошибка, попробуйте еще раз.");
	КонецПопытки;
#КонецЕсли
	
КонецПроцедуры
