//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

//Заполнение списка видов документов
Процедура ЗаполнитьСписок() Экспорт
	// Создание списка документов
	Для Каждого МетаданныеДокумент Из Метаданные.Документы Цикл
		
		Если МетаданныеДокумент.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			СписокДокументов.Добавить(МетаданныеДокумент.Имя, МетаданныеДокумент.Представление());
		КонецЕсли;
		
	КонецЦикла;
	СписокДокументов.СортироватьПоПредставлению();
	
	Проводить = "Проведенные";
	
КонецПроцедуры

//Проведение документов из имеющегося списка
Процедура Провести(ДатаНачала, ДатаОкончания, ТекущееКоличествоПроведенных) Экспорт
	
	Для Каждого ДокументСписка Из ВыбранныеДокументы Цикл
		
		Выборка = Документы[ДокументСписка.Значение].Выбрать(ДатаНачала, ДатаОкончания);
		
		Пока Выборка.Следующий() Цикл
			
			Если Проводить = "Проведенные" И НЕ Выборка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			Если Проводить = "НеПроведенные" И Выборка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			Объект = Выборка.ПолучитьОбъект();
			Объект.Записать(РежимЗаписиДокумента.Проведение);
			ТекущееКоличествоПроведенных = ТекущееКоличествоПроведенных + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
