//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Документ = Параметры.Документ;
	ДатаДокумента = Параметры.ДатаДокумента;
	ТабличныйДокумент = Документы.РасходТовара.ПолучитьМакет("БланкДоставки");
	ТабличныйДокумент.Область("ДатаОформления").Значение = ДатаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	Если Область.Имя = "ДатаДоставки" Тогда
		ТабличныйДокумент.Область("СрокДоставки").Значение =
		    Число(ТабличныйДокумент.Область("ДатаДоставки").Значение - НачалоДня(ДатаДокумента)) / (24 * 60 * 60);
	ИначеЕсли Область.Имя = "СрокДоставки" Тогда
		ТабличныйДокумент.Область("ДатаДоставки").Значение =
		    НачалоДня(ДатаДокумента) + ТабличныйДокумент.Область("СрокДоставки").Значение * 24 * 60 * 60;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область("Адрес");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПакетаДокументов(Команда)
	Пакет = ПечатьПакетаДокументовНаСервере();
	Пакет.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
КонецПроцедуры

&НаСервере
Функция ПечатьПакетаДокументовНаСервере()
	Пакет = Новый ПакетОтображаемыхДокументов;
	
	Пакет.Состав.Добавить().Данные = ПоместитьВоВременноеХранилище(ТабличныйДокумент, УникальныйИдентификатор);
	
	РасходнаяНакладная = Новый ТабличныйДокумент;
	Документ.ПолучитьОбъект().ПечатнаяФорма(РасходнаяНакладная);
	Пакет.Состав.Добавить().Данные = ПоместитьВоВременноеХранилище(РасходнаяНакладная, УникальныйИдентификатор);
	
	Возврат Пакет;
КонецФункции
